[
  {
    "path": "posts/2021-09-20-old-lyme-ospreys-2020-season-review/",
    "title": "Old Lyme Ospreys - 2020 Review",
    "description": "A quick look at the 2020 Osprey Nation Report by the Connecticut Audobon Society, released on March 5, 2021.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": {}
      }
    ],
    "date": "2021-09-20",
    "categories": [],
    "contents": "\r\nSource for data and Osprey Nation 2020 report: https://www.ctaudubon.org/osprey-nation-home/\r\nOsprey Nation\r\nThe CT Audobon’s Osprey Nation is a citizen-science project intended to collect data on Osprey nesting in Connecticut every year. As such, the initiative relies on volunteer stewards to monitor the vast number of nests in Connecticut, with a record 733 monitored in 2020 despite the COVID-19 pandemic.\r\nOspreys in Connecticut\r\n\r\nOspreys in Essex Land Trust.\r\nAccording to the CT DEEP, the osprey population in Connecticut reached a record low of only 9 active nests in 1974. The population suffered from pressure due to coastal development and DDT contamination causing eggshell thinning. Since the banning of DDT and restrictions on other pesticides in the 1970s, their population in the state has steadily been on the rise.\r\nSource: https://portal.ct.gov/DEEP/Wildlife/Fact-Sheets/Osprey\r\nOsprey Nation Stewards\r\nIntro to blog (compare single town to overall CT data)…\r\nLet’s take a look at the data:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-20-old-lyme-ospreys-2020-season-review/images/ct-audobon-logo.png",
    "last_modified": "2021-09-23T21:56:54-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-16-meds-week-3-recap/",
    "title": "MEDS Week 3 Recap",
    "description": "A brief look at some of the concepts we've learned so far.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [],
    "contents": "\r\nWe are in week 3 of the MEDS program at UCSB’s Bren School of Environmental Science and Management. Here are a few things that we’ve learned…\r\nR functions:\r\nSo far, we have learned various methods of getting data into more usable formats.\r\nHere is an example of using the dplyr group_by and summarize functions…\r\n\r\n# A tibble: 3 x 2\r\n  species   mean_body_mass_g\r\n  <fct>                <dbl>\r\n1 Adelie               3701.\r\n2 Chinstrap            3733.\r\n3 Gentoo               5076.\r\n\r\nConcepts\r\nWe have also learned fundamental concepts for working with data. One such concept is tidy data, which refers to the following qualities: - Each column contains a single variable - Each row contains a single observation - Each cell contains a single value\r\nThis is important for other important concepts that we’ve learned, such as scientific reproducibility.\r\nTakeaways\r\nThe MEDS program has been rewarding and challenging in the initial weeks. I have learned to think critically and deliberately about every bit of code that I write. I have also appreciated the helpful and collaborative community that has formed in our small cohort.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-08-16-meds-week-3-recap/images/logo-bren.svg",
    "last_modified": "2021-08-16T16:59:05-07:00",
    "input_file": {}
  }
]
