[
  {
    "path": "portfolio/2021-12-23-group-project/",
    "title": "Capstone Project",
    "description": "Reproducible Machine Learning Approach for Interpreting Ecohydrologic Model Outputs.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": "https://alexclippinger.github.io"
      },
      {
        "name": "Peter Menzies",
        "url": "https://petermenzies.github.io"
      },
      {
        "name": "Wylie Hampson",
        "url": "https://wyliehampson.github.io"
      },
      {
        "name": "Shale Hunter",
        "url": "https://hub-shale.github.io"
      }
    ],
    "date": "2022-10-10",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nBackground\r\n\r\n\r\nEcohydrologic models are core tools when investigating how climate\r\ncan influence water, carbon, and energy cycles in natural and urbanizing\r\nlandscapes. RHESSys and other similar models are becoming increasingly\r\nsophisticated due to advances in software engineering, increased data\r\navailability, and a growing body of knowledge within the field of\r\necohydrology. Due to the complexity of these models, interpreting the\r\nhigh volume of data they output is a key challenge—both for scientists\r\nand the public. Using machine learning, researchers understanding and\r\ninterpretation of model output can be enhanced and accelerated.\r\n\r\n\r\n\r\nRole\r\n\r\n\r\nI collaborated with 3 peers to develop a workflow to allow researchers\r\nto quickly find patterns and relationships in RHESSys model output using\r\nmachine learning tools.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSkills\r\n\r\n\r\nR (RStudio)RShinyGitHubMachine Learning\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTimeline\r\n\r\n\r\nJanuary - June 2022\r\n\r\n\r\n\r\nIntroduction\r\nFor my Capstone Project, I worked with the creator of The Regional\r\nHydro-Ecological Simulation System (RHESSys), Dr. Naomi Tague, and the\r\nTague Team Lab at UCSB’s Bren School.\r\nRHESSys is a GIS-based ecohydrologic model that assesses nutrient and\r\nwater cycling at varying spatial scales. RHESSys is used by researchers\r\nto, among other applications, investigate climate change impacts on\r\nforest ecosystems. For example, Burke et. al 2021\r\nexplored fuel treatment effects on forest health and fires, and Peng et. al 2013 analyzed\r\nthe effect of timing of precipitation and snow melt recharge on stream\r\nflow.\r\nProblem\r\nRHESSys, like other process-based models, can produce massive data\r\nsets with spatial, temporal, and non-linear variable relationships. The\r\nfigure below demonstrates the complexity of the project’s case study\r\ndata for the Sagehen Creek Field Station.\r\nThe goal of this project is to make it easier for researchers to\r\nquickly analyze and understand RHESSys output.\r\nThis project is currently in progress. For more\r\ninformation prior to completion, please see the Initial\r\nProject Proposal.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-10T22:45:19-08:00",
    "input_file": {}
  },
  {
    "path": "portfolio/2021-12-23-map-collection/",
    "title": "Map Collection",
    "description": "A collection of maps created for Educational, Volunteer, and Professional purposes.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": "https://alexclippinger.github.io"
      }
    ],
    "date": "2021-12-23",
    "categories": [],
    "contents": "\r\n\r\nBig Seki Loop\r\n\r\n\r\n\r\nBackground\r\n\r\n\r\nAs the final project for EDS240 (Data Visualization) in my Master of\r\nEnvironmental Data Science degree, we were tasked with creating a\r\nvisualization that told a story. For my project, I chose to create a\r\ngraphic that would capture the personal memories and details of a\r\nbackpacking trip that someone close to me completed in June of 2020.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSkills\r\n\r\n\r\nR (RStudio)ArcGIS ProFigma\r\n\r\n\r\n\r\n\r\n\r\n\r\nTimeline\r\n\r\n\r\nJanuary - March 2022\r\n\r\n\r\n\r\n\r\nData visualization of a backpacking trip along the Big Seki Loop.\r\nClick here for the\r\nfull-sized image\r\nThe map was created in ArcGIS Pro using a variety of data sources,\r\nincluding an SRTM Digital Elevation Model and National Park Service\r\ntrails, boundaries, and water bodies. The elevation line chart was\r\ncreated using a GPX file downloaded from CalTopo that was then processed and\r\nvisualized in R. Lastly, the vast majority of the graphic design work\r\nwas completed in Figma - including the trip journal, chart axes, and\r\nmany finishing touches to the map (labels, linear gradients, masks, and\r\nmore). I am extremely happy with the finished product!\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-10T22:45:19-08:00",
    "input_file": {}
  },
  {
    "path": "portfolio/2021-12-04-old-lyme-land-trust-gis-overlay-analysis/",
    "title": "A GIS Overlay Analysis for the Old Lyme Land Trust",
    "description": "As a GIS Volunteer for the Old Lyme Land Trust, I delivered a GIS overlay analysis that identified properties with high natural resource value in order to assist with conservation acquisition targets.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": {}
      }
    ],
    "date": "2021-12-04",
    "categories": [
      "GIS"
    ],
    "contents": "\r\n\r\nBackground\r\nIn 2020, I was a GIS Volunteer with the Old Lyme Land Trust (OLLT).\r\nThis blog post details a project conducted for the OLLT in April 2020,\r\nwhich was delivered to board members. This also served as the final\r\nproject of GIS\r\n6320 during my Graduate Certificate in GIS.\r\nClient\r\nThe OLLT is a non-profit organization dedicated to conserving land\r\nand water resources for the public of Old Lyme, a coastal town in\r\nSoutheastern Connecticut. Local land trusts like the OLLT are vital to\r\nnatural resource conservation and education in the lower Connecticut\r\nRiver region. This area was identified by the Nature Conservancy as a\r\nfocal area in their “Resilient Sites for Terrestrial Conservation in the\r\nNortheast and Mid-Atlantic Region” report (Source).\r\n\r\nMaps depicting the location of Old Lyme, Connecticut. The town is\r\nlocated in Southeastern Connecticut at the mouth of the Connecticut\r\nRiver.\r\nThe OLLT protects 70 properties covering roughly 1,100 of 16,000\r\nacres of land in the town and is continuously seeking new acquisitions\r\n(Source). These efforts\r\nare primarily placed on parcels that are adjacent to existing preserves\r\nor town open space, with a goal of linking these properties to create\r\ntown-wide trail systems and wildlife corridors. However, there was not a\r\ncomprehensive understanding of the spatial distribution of important\r\nnatural resources.\r\nAnalysis Plan\r\nThis project aimed to address this lack of insight into areas and\r\nparcels in Old Lyme with a high concentration of natural resources and\r\nthus an increased priority for conservation efforts. Taking into\r\nconsideration both key natural resources criteria and OLLT Board Member\r\nconcerns, the results provided a basis for acquisition targets and\r\nsupport for grant applications. These criteria are weighted and combined\r\nusing a GIS overlay analysis.\r\nIn all, the project answered two principal questions:\r\nWhat is the distribution of key natural resources in\r\ntown?\r\nWhich parcels contain high values of natural resources and other\r\nconservation criteria?\r\nOverlay Analysis\r\nThe overlay analysis follows the standard methodology outline by Esri\r\nthat can be applied in suitability modeling and optimal site selection\r\n(Source).\r\nThese key steps include defining the problem, breaking into-sub models,\r\ndetermining significant layers, reclassifying these layers to be\r\ncomparable, weighting based on specific project goals, then finally\r\ncombining the inputs, and analyzing the results (ibid.). An overlay\r\nanalysis is a common technique to apply a common scale to diverse inputs\r\nto create an integrated analysis.\r\n\r\nThis image depicts the basic idea of an overlay analysis - aggregating\r\nvalues of various data layers\r\nTable 1 summarizes the sub-models, data layers, initial data types,\r\nand weights initially used for this analysis. Using this approach, each\r\nparcel received a value between 0 and 12 representing prioritization\r\nlevel for conservation and targeting by the land trust. The sub-models\r\nwere devised by referencing the Lower CT River and Coastal Region Land\r\nTrust Exchange’s (LTE) Natural\r\nResource Based Strategic Conservation Plan, which is a similar\r\nregional model focusing on large-scale corridor connectivity, and\r\nsupported by direct feedback from OLLT Board Members.\r\nAfter discussion with the OLLT Acquisition Lead, geological\r\nareas were added as another layer of interest. The final input\r\nlayers are displayed below:\r\nClick here for the\r\nfull-sized image\r\nFor full details on how these data layers were processed and\r\ncombined, see the Final Project Report linked at the bottom of this\r\npage.\r\nResults\r\nThe raster layer representing the weighted matrix of natural resource\r\ncriteria is seen in the map below.\r\n\r\nThe map depicts natural resource values as a result of the overlay\r\nanalysis. Particular areas of high resource values include the\r\nLieutenant River, Black Hall River, and Great Island.\r\nThe largest concentration of natural resources is in coastal and\r\nriparian zones of the Connecticut River, as well as marshy wetlands\r\nsurrounding the Lieutenant and Black Hall rivers. The large forest areas\r\nin the central and North-East parts of the town also have high\r\nvalues.\r\nThe following map shows the results of the parcel prioritization.\r\n\r\nParcels in darker shades of green have higher average values of natural\r\nresources. Additionally, these conservation values take into account\r\nproximity to existing protected land and parcel size.\r\nFortunately, many of these parcels are existing property of the OLLT,\r\nOpen Space Commission, or other agencies as shown in the map below.\r\n\r\nThis map contains the same information as previous, now including\r\nexisted protected property.\r\nParcels in the areas listed above (riparian and coastal zones) remain\r\nwith the highest conservation importance. However, some larger parcels\r\nand those close to existing Land Trust property have received a boosted\r\nfocus. Notably, the large properties adjacent to the Upper Three Mile\r\nRiver preserve (large OLLT preserve in the North-East of the town) are\r\nidentified as important targets. These properties are known priorities\r\nfor the OLLT to complete the linkage of preserve property in that\r\narea.\r\nThe table below lists the highest valued parcels for\r\nconservation.\r\nParcel IDs can be searched using the Town of Old Lyme MapGeo\r\nsite.\r\nAll of these properties are in coastal or riparian zones, with the\r\nhighest concentration at the inlet of the Lieutenant River. It is quite\r\nnotable that 75% of the top 20 properties are already owned and\r\nprotected by the Town of Old Lyme, State of Connecticut, Old Lyme Land\r\nTrust, or Nature Conservancy, with an impressive 30% protected by the\r\nOLLT.\r\nHere are the final outputs that resulted from this project:\r\nInitial\r\nProject Proposal\r\nFinal Project\r\nReport\r\nSlide\r\nDeck for Board Members\r\nParcel Conservation\r\nValue Data\r\n\r\n\r\n\r\n\r\n",
    "preview": "portfolio/2021-12-04-old-lyme-land-trust-gis-overlay-analysis/images/ollt.png",
    "last_modified": "2023-03-10T22:45:19-08:00",
    "input_file": {},
    "preview_width": 1909,
    "preview_height": 693
  },
  {
    "path": "portfolio/2021-11-02-sf-crime-and-hilliness/",
    "title": "Regression Analysis of Crime and Topography in San Francisco",
    "description": "Does topography have an effect on the likelihood of car break-ins? This regression analysis seeks to provide insights into this question using data from San Francisco, which has ideal geography for this context.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": {}
      }
    ],
    "date": "2021-11-02",
    "categories": [
      "R",
      "GIS"
    ],
    "contents": "\r\n\r\n\r\nThat is one steep street!\r\nAnalysis Plan\r\nThis analysis will follow the specific steps outlined in Table 1 below:\r\n\r\n\r\nShow code\r\n\r\ndata.frame(\"Step\" = c(1:8),\r\n           \"Description\" = c(\"Identify research question\", \r\n                             \"Select key variables\",\r\n                             \"Collect data\",\r\n                             \"Describe data\",\r\n                             \"Visualize relationships\",\r\n                             \"Test OLS assumptions\",\r\n                             \"Conduct regression analysis\",\r\n                             \"Interpret results\")) %>% \r\n  kable(caption = \"Analysis Plan\") %>%\r\n  kable_paper(full_width = FALSE) %>%\r\n  kable_styling(latex_options = \"striped\",\r\n                font_size = 15) %>% \r\n  column_spec(1, bold = T) %>%\r\n  row_spec(0, bold = T, color = \"black\")\r\n\r\n\r\n\r\nTable 1: Analysis Plan\r\n\r\n\r\nStep\r\n\r\n\r\nDescription\r\n\r\n\r\n1\r\n\r\n\r\nIdentify research question\r\n\r\n\r\n2\r\n\r\n\r\nSelect key variables\r\n\r\n\r\n3\r\n\r\n\r\nCollect data\r\n\r\n\r\n4\r\n\r\n\r\nDescribe data\r\n\r\n\r\n5\r\n\r\n\r\nVisualize relationships\r\n\r\n\r\n6\r\n\r\n\r\nTest OLS assumptions\r\n\r\n\r\n7\r\n\r\n\r\nConduct regression analysis\r\n\r\n\r\n8\r\n\r\n\r\nInterpret results\r\n\r\n\r\n1. Research Question\r\nMy research question is: What is the relationship between topography and car break-ins in San Francisco?\r\nBackground\r\nBoth terrain and motor vehicle crimes are ubiquitous when discussing living or visiting San Francisco. In April 2021, Young-An Kim & James C. Wo published Topography and crime in place: The effects of elevation, slope, and betweenness in San Francisco street segments. This study supports the idea that “hilliness” has an effect on crime, taking into consideration socio-economic characteristics Kim and Wo (2021). However, their analysis did not separate by specific crime categories and instead included all types of crime, including violent, nonviolent, property, etc.\r\nMy analysis will focus only on car break-ins rather than all crime reports, as I believe that these crimes will have a more significant relationship with topography. In addition, my analysis will use more recent crime report and socio-economic data sets. Understanding the relationship between topography and car break-ins can influence local-level policy decisions and direct limited resources dedicated to crime prevention. For example, the city could focus enforcement and policy on areas within certain elevation and slope ranges that are identified in this analysis as being particularly susceptible to car break-ins.\r\n2. Select key variables\r\nTable 2 below contains the key measures of interest in our analysis:\r\n\r\n\r\nShow code\r\n\r\ndata.frame(\"Dependent Variable\" = c(\"Number of Car Break-Ins\", \"\"),\r\n           \"Independent Variables\" = c(\"Elevation\", \"Slope\"), \r\n           \"Control Variable\" = c(\"Median Income\",\"\")) %>% \r\n  kable(col.names = c(\"Dependent Variable\", \"Independent Variables\", \"Control Variable\"), caption = \"Key variables for regression analysis\") %>%\r\n  kable_paper(full_width = FALSE) %>%\r\n  kable_styling(latex_options = \"striped\",\r\n                font_size = 15) %>% \r\n  column_spec(1, bold = T) %>%\r\n  row_spec(0, bold = T, color = \"black\")\r\n\r\n\r\n\r\nTable 2: Key variables for regression analysis\r\n\r\n\r\nDependent Variable\r\n\r\n\r\nIndependent Variables\r\n\r\n\r\nControl Variable\r\n\r\n\r\nNumber of Car Break-Ins\r\n\r\n\r\nElevation\r\n\r\n\r\nMedian Income\r\n\r\n\r\n\r\n\r\nSlope\r\n\r\n\r\n\r\n\r\nWhen discussing topography, both elevation and slope are necessary for inclusion because these two capture the effect of local level topography. In any econometric analysis, it is vital to control for socio-economic variables. Thus, median income is included as a control variable.\r\nHere is the regression equation:\r\n\\[NumBreakIns_i = \\beta_0 + \\beta_1Elevation_i + \\beta_2Slope_i + \\beta_3MedianIncome_i + u_i\\]\r\nBased on the existing literature by Kim & Wo, it is expected that there is a negative correlation between number of car break-ins and all three independent variables.\r\n3. Collect data\r\nCrime (City and San Francisco (2021))\r\nRetrieved from the San Francisco Open Data Portal\r\nAll crime reports from 2018-01-01 to 2021-11-04.\r\nQueried to only include “Motor Vehicle Theft”\r\n\r\nLocations are aggregated to closest street intersections.\r\n\r\nElevation contours (City and San Francisco (2021))\r\nRetrieved from the San Francisco Open Data Portal\r\n5 ft. elevation contours\r\nUsed directly for elevation and also to derive slope through a geo-processing workflow in QGIS with GRASS (see this video for details on this process).\r\n\r\nMedian income (Walker (2021))\r\nRetrieved through the tidycensus package via the US Census Bureau.\r\ncensus Tract detail level from the 5-year 2015-2019 ACS data.\r\n\r\nSince our variables interact over space, we merge the crimes, topography, and median income data sets by spatially joining them together. All data sets are loaded into R as shapefiles in the Coordinate Reference System (CRS) EPSG:7132 (NAD83(2011) / San Francisco CS13 (ftUS)), which is a projected CRS for the city and county of San Francisco adequate for high-precision (0.03 ft) analysis.\r\n4. Describe data\r\nThe summary statistics for the data are provided in Table 3 below.\r\n\r\n\r\nShow code\r\n\r\ncrimes %>% \r\n  #st_drop_geometry() %>% \r\n  select(slope, elev, median_income) %>% \r\n  psych::describe(fast=TRUE) %>% \r\n  kable(col.names = c(\"\", \"Count\", \"Mean\", \"SD\", \"Min\", \"Max\", \"Range\", \"SE\"), caption = \"Summary statistics for Slope, Elevation, and Median Income variables\") %>%\r\n  kable_paper(full_width = FALSE) %>%\r\n  kable_styling(latex_options = \"striped\",\r\n                font_size = 15) %>% \r\n  column_spec(1, bold = T) %>%\r\n  row_spec(0, bold = T, color = \"black\")\r\n\r\n\r\n\r\nTable 3: Summary statistics for Slope, Elevation, and Median Income variables\r\n\r\n\r\n\r\n\r\n\r\n\r\nCount\r\n\r\n\r\nMean\r\n\r\n\r\nSD\r\n\r\n\r\nMin\r\n\r\n\r\nMax\r\n\r\n\r\nRange\r\n\r\n\r\nSE\r\n\r\n\r\nslope\r\n\r\n\r\n1\r\n\r\n\r\n24454\r\n\r\n\r\n4.492966\r\n\r\n\r\n4.793824\r\n\r\n\r\n0\r\n\r\n\r\n68\r\n\r\n\r\n68\r\n\r\n\r\n0.0306554\r\n\r\n\r\nelev\r\n\r\n\r\n2\r\n\r\n\r\n24454\r\n\r\n\r\n129.321379\r\n\r\n\r\n120.439659\r\n\r\n\r\n-5\r\n\r\n\r\n780\r\n\r\n\r\n785\r\n\r\n\r\n0.7701841\r\n\r\n\r\nmedian_income\r\n\r\n\r\n3\r\n\r\n\r\n23764\r\n\r\n\r\n114039.269567\r\n\r\n\r\n47501.416992\r\n\r\n\r\n12340\r\n\r\n\r\n208425\r\n\r\n\r\n196085\r\n\r\n\r\n308.1390882\r\n\r\n\r\nWe can see in the count column that there are 24,454 total break-ins in our data, with some missing values for median income. The slope ranges from 0 to 68 percent (~34 degrees) with a mean value of approximately 4.5 percent. This indicates that there are vastly more break-ins on flatter streets as expected. The elevation ranges from -5 to 780 feet with a mean value of approximately 130 (note: negative values are a result of attaching the nearest contour level to crimes very close to the coastline). Again, there are more break-ins at lower elevations than higher. The median income ranges from ~$12,000 to ~$208,000 with a mean value of approximately $114,000. This indicates that our median income data appears to be somewhat evenly distributed.\r\nThe box plots below visualize these observations:\r\n\r\n\r\nShow code\r\n\r\nslope_box <- ggplot(data = crimes_summary, aes(x = \"\", y = slope)) +\r\n  geom_boxplot(color = \"orange\") +\r\n  geom_jitter(aes(color = slope), \r\n              width = 0.2,\r\n              size=0.4, \r\n              alpha=0.1, \r\n              show.legend = FALSE) +\r\n  theme_classic() +\r\n  theme(axis.text.x = element_blank(),\r\n        axis.ticks.x = element_blank(),\r\n        axis.title.y = element_blank()) +\r\n  labs(x = \"Slope (%)\")\r\n\r\nelev_box <- ggplot(data = crimes_summary, aes(x = \"\", y = elev)) +\r\n  geom_boxplot(color = \"darkgreen\") +\r\n  geom_jitter(aes(color = elev), \r\n              width = 0.2,\r\n              size=0.4, \r\n              alpha=0.1, \r\n              show.legend = FALSE) +\r\n  theme_classic() +\r\n  theme(axis.text.x = element_blank(),\r\n        axis.ticks.x = element_blank(),\r\n        axis.title.y = element_blank()) +\r\n  labs(x = \"Elevation (feet)\")\r\n\r\nincome_box <- ggplot(data = crimes_summary, aes(x = \"\", y = median_income)) +\r\n  geom_boxplot(color = \"blue\") +\r\n  geom_jitter(aes(color = median_income), \r\n              width = 0.2,\r\n              size=0.4, \r\n              alpha=0.1, \r\n              show.legend = FALSE) +\r\n  theme_classic() +\r\n  theme(axis.text.x = element_blank(),\r\n        axis.ticks.x = element_blank(),\r\n        axis.title.y = element_blank()) +\r\n  labs(x = \"Median Income (USD)\")\r\n\r\nelev_box + slope_box + income_box + plot_annotation(title = 'Figure 1. Distributions of Independent Variables',\r\n                                                    theme = theme(plot.title = element_text(hjust = 0.5)))\r\n\r\n\r\n\r\n\r\nThe box plots more clearly demonstrate that both elevation and slope have more occurrences at low values than high values, with high outliers. These extreme values appear to be accurate - the highest peak in San Francisco is Mount Davidson at 938 feet and the steepest surveyed road is Bradford Street at 41% grade. This indicates that two of the slope outliers are likely due to data artifacts.\r\nThe following maps visualize the four variables:\r\n\r\nVisualizing the spatial distribution of crime data in relation to the distributions of the three independent variables (elevation, slope, and median income).\r\n5. Visualize relationships\r\nThe following plots in Figure 2 show the simple relationships between count of car break ins and the three independent variables (elevation, slope, and median income).\r\n\r\n\r\nShow code\r\n\r\n# Group by income\r\nincome_summary <- crimes %>% \r\n  #st_drop_geometry() %>% \r\n  group_by(median_income) %>% \r\n  summarize(count = n())\r\n\r\nincome_plot = ggplot(data = income_summary, aes(x = median_income, y = count)) +\r\n  geom_point(alpha = 0.5, color = \"darkgreen\") +\r\n  geom_smooth(method = \"lm\", se = FALSE) +\r\n  theme_classic() +\r\n  labs(title = \"Crime and Median Income\",\r\n       x = \"Median Income (USD)\",\r\n       y = \"Number of Break-Ins\") +\r\n  theme(title = element_text(size = 10))\r\n\r\n# Group by elevation\r\nelev_summary <- crimes %>% \r\n  #st_drop_geometry() %>% \r\n  group_by(elev) %>% \r\n  summarize(count = n())\r\n\r\nelev_plot <- ggplot(data = elev_summary, aes(x = elev, y = count)) +\r\n  geom_point(alpha = 0.5, color = \"orange\") +\r\n  geom_smooth(method = \"lm\", se = FALSE) +\r\n  theme_classic() +\r\n  labs(title = \"Crime and Elevation\",\r\n       x = \"Elevation (feet)\",\r\n       y = \"Number of Break-Ins\") +\r\n  theme(title = element_text(size = 10))\r\n\r\n# Group by slope\r\nslope_summary <- crimes %>% \r\n  #st_drop_geometry() %>% \r\n  group_by(slope) %>% \r\n  summarize(count = n())\r\n\r\nslope_plot <- ggplot(data = slope_summary, aes(x = slope, y = count)) +\r\n  geom_point(alpha = 0.5, color = \"blue\") +\r\n  geom_smooth(method = \"lm\", se = FALSE) +\r\n  theme_classic() +\r\n  labs(title = \"Crime and Slope\",\r\n       x = \"Slope (percent)\",\r\n       y = \"Number of Break-Ins\") +\r\n  theme(title = element_text(size = 10))\r\n\r\nelev_plot + (slope_plot / income_plot) + plot_annotation(title = 'Figure 2. Simple relationships',\r\n                                                    theme = theme(plot.title = element_text(hjust = 0.5)))\r\n\r\n\r\n\r\n\r\nThere is a negative correlation between elevation and crime. It also appears that this relationship is not linear, so the model may fit better if transformed. Additionally, there is a negative correlation between slope and crime also showing signs of a non-linear relationship, supporting the justification for a transformation. Lastly, there appears to be a weak negative correlation, or even possibly no significant relationship, between median income and car break-ins.\r\n6. Test OLS Assumptions\r\nIn order to appropriately utilize an Ordinary Least Squares (OLS) regression model, the following set of key assumptions should be met:\r\nThe population relationship is linear in parameters with an additive disturbance.\r\nOur \\(X\\) variables are exogenous, i.e., \\(\\mathop{\\boldsymbol{E}}\\left[ u \\mid X \\right] = 0\\).\r\nThe \\(X\\) variables have variation.\r\nThe population disturbances \\(u_i\\) are independently and identically distributed as normal random variables with mean zero \\(\\left( \\mathop{\\boldsymbol{E}}\\left[ u \\right] = 0 \\right)\\) and variance \\(\\sigma^2\\) (i.e., \\(\\mathop{\\boldsymbol{E}}\\left[ u^2 \\right] = \\sigma^2\\))\r\nFor the purpose of this analysis, Assumption #1 holds because the relationships observed in Figure 2 appear linear in parameters. Additionally, this analysis claims that Assumption #2 holds. Assumption #3 holds because the \\(x\\) variables have variation as shown in Figures 1 and 2.\r\nBelow, Assumption #4 is tested by generating the residuals from the main regression equation and to assess all components. The distribution of residuals is shown in Figure 5. below:\r\n\r\n\r\nShow code\r\n\r\ncrime_lm <- crimes_summary %>% \r\n  add_predictions(model = lm(count ~ elev + slope + median_income, data = crimes_summary)) %>% \r\n  mutate(res = count - pred)\r\n\r\nggplot(data = crime_lm, aes(x = res)) +\r\n  geom_histogram(binwidth = 5, fill = \"darkblue\", col = \"black\") + \r\n  labs(title = \"Figure 5. Residual Plot\",\r\n       x = \"Residuals\",\r\n       y = \"Count\") +\r\n  theme_classic()\r\n\r\n\r\n\r\n\r\nThe residuals do not appear to be normally distributed because there is a long right tail. This indicates that the model is over-estimating the dependent variable for certain values of the independent variables.\r\nNext, Figure 6 shows a QQ plot of the distribution, which visualizes the normality of the residuals.\r\n\r\n\r\nShow code\r\n\r\nggplot(data = crime_lm, aes(sample = res)) +\r\n  geom_qq(alpha = 0.5, color = \"magenta\") +\r\n  geom_qq_line() +\r\n  theme_classic() +\r\n  labs(title = \"Figure 6. QQ Plot\",\r\n       x = \"Theoretical Normal Distribution\",\r\n       y = \"Analysis Residuals Distribution\")\r\n\r\n\r\n\r\n\r\nThe QQ plot indicates that the residuals are relatively normally distributed for values up to approximately 2 on the theoretical normal distribution. This supports the conclusion from Figure 5 that the model residuals are not normally distributed for high values.\r\nLastly, Figure 7 tests whether the residuals appear to have constant variance when plotted against our independent variables.\r\n\r\n\r\nShow code\r\n\r\ny1 <- ggplot(data = crime_lm, aes(x = elev, y = res)) +\r\n  geom_point(alpha = 0.25, color = \"darkgreen\") + theme_classic() + \r\n  labs(title = \"Residuals vs. Elevation\",\r\n       x = \"Elevation (feet)\",\r\n       y = \"Residual Error\") +\r\n  theme(title = element_text(size = 10))\r\n\r\ny2 <- ggplot(data = crime_lm, aes(x = slope, y = res)) +\r\n  geom_point(alpha = 0.25, color = \"orange\") + theme_classic() + \r\n  labs(title = \"Residuals vs. Slope\",\r\n       x = \"Slope (percent)\",\r\n       y = \"Residual Error\") +\r\n  theme(title = element_text(size = 10))\r\n\r\ny3 <- ggplot(data = crime_lm, aes(x = median_income, y = res)) +\r\n  geom_point(alpha = 0.25, color = \"blue\") + theme_classic() + \r\n  labs(title = \"Residuals vs. Income\",\r\n       x = \"Median Income\",\r\n       y = \"Residual Error\") +\r\n  theme(title = element_text(size = 10))\r\n\r\ny1 + (y2 / y3) + plot_annotation(title = 'Figure 7. Residual variance across independent variables',\r\n                                         theme = theme(plot.title = element_text(hjust = 0.5)))\r\n\r\n\r\n\r\n\r\nIt does not appear that the residuals have constant variance for the independent variables. The plots for elevation and slope have higher variance for lower values and all three plots do not appear to be centered at 0. Therefore, it is likely that Assumption #4 is violated.\r\nSince Assumptions #1, #2, and #3 appear to be satisfied, in this case using OLS is an unbiased estimator of the coefficients. However, Figures 5-7 provide sufficient concern that Assumption #4 is not satisfied and therefore OLS may not be the estimator with lowest variance. An alternative estimator to OLS may provide estimates of the true population parameters with less variance. The analysis will continue using OLS while taking this into account as a limitation for the interpretation of results.\r\n7. Regression Analysis\r\nModel 1\r\nBelow are the results of the OLS regression analysis for the original equation, which is repeated below:\r\n\\[NumBreakIns_i = \\beta_0 + \\beta_1Elevation_i + \\beta_2Slope_i + \\beta_3MedianIncome_i + u_i\\]\r\n\r\n\r\nShow code\r\n\r\nmodel <- lm(formula = count ~ elev + slope + median_income, data = crimes_summary)\r\n\r\nsumm(model, digits = 7) \r\n\r\n\r\n\r\nObservations\r\n\r\n\r\n4391 (23 missing obs. deleted)\r\n\r\n\r\nDependent variable\r\n\r\n\r\ncount\r\n\r\n\r\nType\r\n\r\n\r\nOLS linear regression\r\n\r\n\r\nF(3,4387)\r\n\r\n\r\n151.4730923\r\n\r\n\r\nR²\r\n\r\n\r\n0.0938608\r\n\r\n\r\nAdj. R²\r\n\r\n\r\n0.0932411\r\n\r\n\r\n\r\n\r\nEst.\r\n\r\n\r\nS.E.\r\n\r\n\r\nt val.\r\n\r\n\r\np\r\n\r\n\r\n(Intercept)\r\n\r\n\r\n10.1472401\r\n\r\n\r\n0.3589623\r\n\r\n\r\n28.2682638\r\n\r\n\r\n0.0000000\r\n\r\n\r\nelev\r\n\r\n\r\n-0.0139627\r\n\r\n\r\n0.0009376\r\n\r\n\r\n-14.8922804\r\n\r\n\r\n0.0000000\r\n\r\n\r\nslope\r\n\r\n\r\n-0.1468949\r\n\r\n\r\n0.0213511\r\n\r\n\r\n-6.8799698\r\n\r\n\r\n0.0000000\r\n\r\n\r\nmedian_income\r\n\r\n\r\n-0.0000094\r\n\r\n\r\n0.0000027\r\n\r\n\r\n-3.4337539\r\n\r\n\r\n0.0006008\r\n\r\n\r\n Standard errors: OLS\r\n\r\n\r\nFirst, the coefficients can be interpreted from the summary above:\r\nIntercept: When elevation, slope, and median income are equal to \\(0\\), the expected average number of car break-ins is ~10.15.\r\nElevation: With all else constant, for a 1 foot increase in elevation, there is a ~0.014 decrease in the number of break-ins.\r\nSlope: With all else constant, for a 1 percent increase in slope, there is a ~0.15 decrease in the number of break-ins.\r\nMedian Income: With all else constant, for a $1 increase in USD, there is a ~0.00001 decrease in the number of break-ins (more intuitively, a $10,000 increase has an expected decrease in break-ins of 0.1).\r\nNext, we can interpret the significance of these coefficients using the p-value. For all independent variables, the p-value is less than 0.001 indicating that each of the independent variables have a significant effect.\r\nLastly, the \\(R^2\\) value of approximately 0.09 indicates that ~9% of the variance in number of break-ins is accounted for in the model. This is an expectedly low result, as crime is most likely going to be related to many other socio-economic and demographic factors that were not considered in this analysis, such as population density, racial composition, land use, etc. However, this analysis singles out the possible effects of topography.\r\nModel 2: Logarithmic transformation of dependent variable\r\nIt is also important to compare the results of the OLS analysis with an alternative regression equation. In earlier sections, it was identified that the relationship of both elevation and slope with break-ins appeared to be non-linear. Therefore, it could be appropriate to transform the equation. The equation and summary below demonstrate the different results when log-transforming the dependent variable.\r\n\\[log(NumBreakIns_i) = \\beta_0 + \\beta_1Elevation_i + \\beta_2Slope_i + \\beta_3MedianIncome_i + u_i\\]\r\n\r\n\r\nShow code\r\n\r\nmodel_transformed <- lm(formula = log(count) ~ elev + slope + median_income, data = crimes_summary)\r\n\r\nsumm(model_transformed, digits = 7)\r\n\r\n\r\n\r\nObservations\r\n\r\n\r\n4391 (23 missing obs. deleted)\r\n\r\n\r\nDependent variable\r\n\r\n\r\nlog(count)\r\n\r\n\r\nType\r\n\r\n\r\nOLS linear regression\r\n\r\n\r\nF(3,4387)\r\n\r\n\r\n247.6027651\r\n\r\n\r\nR²\r\n\r\n\r\n0.1448023\r\n\r\n\r\nAdj. R²\r\n\r\n\r\n0.1442175\r\n\r\n\r\n\r\n\r\nEst.\r\n\r\n\r\nS.E.\r\n\r\n\r\nt val.\r\n\r\n\r\np\r\n\r\n\r\n(Intercept)\r\n\r\n\r\n1.8826251\r\n\r\n\r\n0.0391027\r\n\r\n\r\n48.1456352\r\n\r\n\r\n0.0000000\r\n\r\n\r\nelev\r\n\r\n\r\n-0.0019118\r\n\r\n\r\n0.0001021\r\n\r\n\r\n-18.7187543\r\n\r\n\r\n0.0000000\r\n\r\n\r\nslope\r\n\r\n\r\n-0.0211530\r\n\r\n\r\n0.0023258\r\n\r\n\r\n-9.0948218\r\n\r\n\r\n0.0000000\r\n\r\n\r\nmedian_income\r\n\r\n\r\n-0.0000014\r\n\r\n\r\n0.0000003\r\n\r\n\r\n-4.6866190\r\n\r\n\r\n0.0000029\r\n\r\n\r\n Standard errors: OLS\r\n\r\n\r\nThe \\(R^2\\) value for Model 2 of 0.145 is higher than the previous \\(R^2\\) of 0.09 for Model 1. This indicates that a transformation may be a better model fit for the data.\r\nModel 3: Transformation of independent variables\r\nAnother method of transforming the regression equation to deal with non-linear relationships is to log-transform the two independent variables, slope and elevation, which appeared to have non-linear relationships with break-ins.\r\n\\[NumBreakIns_i = \\beta_0 + \\beta_1*log(Elevation_i) + \\beta_2*log(Slope_i) + \\beta_3MedianIncome_i + u_i\\]\r\n\r\n\r\nShow code\r\n\r\ncrimes_transformed <- crimes_summary %>%\r\n  mutate(elev = case_when(elev == -5 ~ 0,\r\n                          TRUE ~ elev)) %>% \r\n  mutate(elev_shift = elev + 0.01,\r\n         slope_shift = slope + 0.01)\r\n\r\nmodel_indeptransformed <- lm(formula = count ~ log(elev_shift) + log(slope_shift) + median_income, data = crimes_transformed)\r\n\r\nsumm(model_indeptransformed, digits = 7)\r\n\r\n\r\n\r\nObservations\r\n\r\n\r\n4386 (28 missing obs. deleted)\r\n\r\n\r\nDependent variable\r\n\r\n\r\ncount\r\n\r\n\r\nType\r\n\r\n\r\nOLS linear regression\r\n\r\n\r\nF(3,4382)\r\n\r\n\r\n261.0966098\r\n\r\n\r\nR²\r\n\r\n\r\n0.1516449\r\n\r\n\r\nAdj. R²\r\n\r\n\r\n0.1510641\r\n\r\n\r\n\r\n\r\nEst.\r\n\r\n\r\nS.E.\r\n\r\n\r\nt val.\r\n\r\n\r\np\r\n\r\n\r\n(Intercept)\r\n\r\n\r\n17.7185565\r\n\r\n\r\n0.5031256\r\n\r\n\r\n35.2169636\r\n\r\n\r\n0.0000000\r\n\r\n\r\nlog(elev_shift)\r\n\r\n\r\n-2.0309857\r\n\r\n\r\n0.0938373\r\n\r\n\r\n-21.6437008\r\n\r\n\r\n0.0000000\r\n\r\n\r\nlog(slope_shift)\r\n\r\n\r\n-0.6512207\r\n\r\n\r\n0.0956560\r\n\r\n\r\n-6.8079447\r\n\r\n\r\n0.0000000\r\n\r\n\r\nmedian_income\r\n\r\n\r\n-0.0000128\r\n\r\n\r\n0.0000026\r\n\r\n\r\n-4.9423452\r\n\r\n\r\n0.0000008\r\n\r\n\r\n Standard errors: OLS\r\n\r\n\r\nThe \\(R^2\\) value for Model 3 of 0.148 is slightly higher still than Model 2, with all coefficients still similarly statistically significant.\r\n8. Interpret Results\r\nIn conclusion, the linear regression model predicts that there are significant negative relationships between the key independent variables (slope and elevation) and the dependent variable (number of car break-ins). While there is a statistically significant relationship with median income, the effect size is seemingly negligible. It was also found that transformations result in better model fit because the non-linear relationships are more accurately taken into account.\r\nThe study found that certain assumptions of OLS were violated, meaning that the OLS method is most likely not the estimator with lowest variance. This needs to be taken into account while interpreting the resulting coefficients of the variables.\r\nThis analysis has room for improvement, including but not limited to:\r\nEnsuring that the OLS assumption violation is solved by the transformation of the data or by using another estimator.\r\nIncluding key socio-economic and demographic variables with more significant correlation than median income.\r\nMore thoroughly researching and selecting the proper transformation method.\r\nAll code for this analysis can be found on GitHub.\r\n\r\n\r\n\r\n\r\nCity, and County of San Francisco. 2021. “DataSF.” \r\n        https://datasf.org/\r\n    \r\n.\r\n\r\n\r\nKim, Young-An, and James C. Wo. 2021. “Topography and Crime in Place: The Effects of Elevation, Slope, and Betweenness in San Francisco Street Segments.” Journal of Urban Affairs, 1–25. https://doi.org/10.1080/07352166.2021.1901591.\r\n\r\n\r\nWalker, Kyle. 2021. “Tidycensus: Load US Census Boundary and Attribute Data as ’Tidyverse’ and ’Sf’-Ready Data Frames.” \r\n        https://CRAN.R-project.org/package=tidycensus\r\n    \r\n.\r\n\r\n\r\n\r\n\r\n",
    "preview": "portfolio/2021-11-02-sf-crime-and-hilliness/images/crime_hills.jpg",
    "last_modified": "2023-03-10T22:45:19-08:00",
    "input_file": {}
  },
  {
    "path": "portfolio/2021-10-18-ames-open-space-flooding/",
    "title": "Visualizing Flooding in Ames Open Space",
    "description": "Returning home from college a few years ago, I went on a hike at a local town open space only to find the trail flooded due to beaver activity. So, I created an ArcGIS Story Map to visualize the extent of the change in landscape.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": {}
      }
    ],
    "date": "2021-10-18",
    "categories": [
      "GIS"
    ],
    "contents": "\r\n\r\n\r\nGraphic showing the change in landscape from 2012 to 2018 in the Ames\r\nOpen Space.\r\nThis is a small side-project that I completed last year. I was\r\ncurious to see the extent of flooding at one of my favorite Open Spaces\r\nin my hometown - the Town of Old Lyme Ames Open Space.\r\nAt the time, I was in the middle of my Graduate\r\nCertificate in GIS and volunteering with the Old Lyme Land Trust, so I\r\nwanted to test my ability to communicate technical information to a\r\nnon-technical crowd. Although brief, this ArcGIS Story Map successfully\r\ndemonstrated the flooding and was ultimately shared with the town Open\r\nSpace Commission as an educational reference.\r\nHere\r\nis the link to the full Story Map\r\n\r\n\r\n\r\n\r\n",
    "preview": "portfolio/2021-10-18-ames-open-space-flooding/images/ames-open-space.jpg",
    "last_modified": "2023-03-10T22:45:18-08:00",
    "input_file": {}
  },
  {
    "path": "portfolio/2021-09-20-old-lyme-ospreys-2020-season-review/",
    "title": "Analyzing the 2020 Osprey Nation Season",
    "description": "Once facing extinction, the Connecticut Osprey population has made a substantial comeback. This post looks at the most recent 2020 Osprey Nation Report by the Connecticut Audobon Society, released on March 5, 2021. Specifically, I focus on a coastal town known for it's birding and wildlife (that also happens to be my hometown!) - Old Lyme.",
    "author": [
      {
        "name": "Alex Clippinger",
        "url": {}
      }
    ],
    "date": "2021-09-20",
    "categories": [
      "R",
      "GIS"
    ],
    "contents": "\r\n\r\nSource for data and Osprey Nation 2020 report: https://www.ctaudubon.org/osprey-nation-home/\r\nOsprey Nation\r\nThe CT Audobon’s Osprey Nation is a citizen-science project launched\r\nin 2014 that collects data on Osprey nesting in Connecticut every year.\r\nAs such, the initiative relies on volunteer stewards to monitor the vast\r\nnumber of nests in Connecticut, with a record 733 monitored in 2020\r\ndespite the COVID-19 pandemic. Stewards collect and send in data on\r\nosprey arrival dates each spring, nest locations, nesting success, and\r\ndeparture dates.\r\nStewards\r\n\r\n\r\nShow code\r\n\r\n# Create data frame columns\r\nyear = c(2014:2020)\r\nstewards = c(100, 146, 224, 287, 314, 342, 231)\r\nnests_with_data = c(174, 322, 420, 540, 603, 732, 733)\r\nactive_nests = c(210, 250, 337, 394, 416, 501, 510)\r\nfledglings = c(NA, 356, 490, 607, 725, 650, \"549/744 estimated\")\r\nfledlings_per_nest = c(NA, 0.69, 0.80, 0.89, 0.93, 0.81, NA)\r\n\r\n# Create data frame\r\ndf <- data.frame(year, stewards, nests_with_data, active_nests, fledglings, fledlings_per_nest)\r\n\r\n# Make NA values blank\r\nopts <- options(knitr.kable.NA = \"\")\r\n\r\n# Create center aligned data table\r\nknitr::kable(df, align = \"cccccc\")\r\n\r\n\r\nyear\r\n\r\n\r\nstewards\r\n\r\n\r\nnests_with_data\r\n\r\n\r\nactive_nests\r\n\r\n\r\nfledglings\r\n\r\n\r\nfledlings_per_nest\r\n\r\n\r\n2014\r\n\r\n\r\n100\r\n\r\n\r\n174\r\n\r\n\r\n210\r\n\r\n\r\n\r\n\r\n\r\n\r\n2015\r\n\r\n\r\n146\r\n\r\n\r\n322\r\n\r\n\r\n250\r\n\r\n\r\n356\r\n\r\n\r\n0.69\r\n\r\n\r\n2016\r\n\r\n\r\n224\r\n\r\n\r\n420\r\n\r\n\r\n337\r\n\r\n\r\n490\r\n\r\n\r\n0.80\r\n\r\n\r\n2017\r\n\r\n\r\n287\r\n\r\n\r\n540\r\n\r\n\r\n394\r\n\r\n\r\n607\r\n\r\n\r\n0.89\r\n\r\n\r\n2018\r\n\r\n\r\n314\r\n\r\n\r\n603\r\n\r\n\r\n416\r\n\r\n\r\n725\r\n\r\n\r\n0.93\r\n\r\n\r\n2019\r\n\r\n\r\n342\r\n\r\n\r\n732\r\n\r\n\r\n501\r\n\r\n\r\n650\r\n\r\n\r\n0.81\r\n\r\n\r\n2020\r\n\r\n\r\n231\r\n\r\n\r\n733\r\n\r\n\r\n510\r\n\r\n\r\n549/744 estimated\r\n\r\n\r\n\r\n\r\nThe table above shows the progression of the Osprey Nation project\r\nover time. Notably, 2020 saw a decrease in stewards and fledglings\r\nobserved due to difficulties with participation during the COVID-19\r\npandemic.\r\nOspreys in Connecticut\r\n\r\n\r\nShow code\r\n<figure>\r\n\r\n<img src=\"./images/osprey_landing.jpg\" alt=\"Ospreys landing on a nest\" style=\"width:50%;\"/>\r\n\r\n<figcaption>\r\n  \r\nOspreys in Essex Land Trust.\r\n\r\n<\/figcaption>\r\n\r\n<\/figure>\r\n\r\nAccording to the CT DEEP, the osprey population in Connecticut\r\nreached a record low of only 9 active nests in 1974. The population\r\nsuffered from pressure due to coastal development and DDT contamination\r\ncausing eggshell thinning. Since the banning of DDT and restrictions on\r\nother pesticides in the 1970s, their population in the state has\r\nsteadily been on the rise.\r\nSource: https://portal.ct.gov/DEEP/Wildlife/Fact-Sheets/Osprey\r\nLoading the Data\r\nAlong with the annual report, Osprey Nation publishes data on nest\r\nlocations, type, stewards, monitored status, and description.\r\nHere is the interactive data map provided on the Osprey Nation\r\nwebsite:\r\n\r\n\r\nI downloaded the data from the map above as a .kmz file,\r\nwhich I loaded in QGIS. To create the subset of only Old\r\nLyme nests, I created a buffer of the town boundary and used the\r\nSelect by location tool in the QGIS Processing Toolbox.\r\nThis could have also been achieved in R by filtering on the\r\nname column of the all_nests data set, since\r\nall Old Lyme nests begin with “Old Lyme”.\r\n\r\n\r\nShow code\r\n\r\n# Load all nests dataset\r\nall_nests <- read.csv(file = \"data/All_Nests.csv\") %>% \r\n  clean_names() %>% \r\n  rename(\"x2021_status\" = 19) %>% \r\n  select(-(description:icon)) \r\n\r\n# load old lyme data only\r\nol_nests <- read.csv(file = \"data/OL-Only_Nests.csv\") %>% \r\n  clean_names() %>% \r\n  rename(\"x2021_status\" = 19) %>% \r\n  select(-(descriptio:icon))\r\n\r\n\r\nOspreys in Old Lyme, CT\r\nFor this blog, I am looking at the town of Old Lyme, CT. This is for\r\na few reasons…\r\nOld Lyme is my hometown!\r\n~10% of nests in the state are found in the town’s coastline and\r\nrivers.\r\nGreat Island and the Lower Connecticut River Valley area are\r\nimportant ecological and conservation areas. The CT Audobon reports that\r\nthe greatest concentration of Osprey nests in the state is on Great\r\nIsland.\r\nOf the 231 stewards that volunteered for the project in 2020, there\r\nwere 26 unique stewards who collected data in Old Lyme.\r\nVisualizing the Data\r\nFirst, I wanted to see how many nests were actively monitored in\r\n2020.\r\n\r\n\r\nShow code\r\n\r\n# ALL NESTS\r\n\r\n# create data set with counts of nests by monitored status\r\nall_nests_monitored <- all_nests %>% \r\n  \r\n  # select only monitored status column\r\n  select(monitored_y_n) %>% \r\n  \r\n  # count by monitored status\r\n  group_by(monitored_y_n) %>% \r\n  summarize(count = n()) %>%\r\n  \r\n  # Add dummy year value for plot\r\n  mutate(year = \"2020\") %>% \r\n  \r\n  # Add proportion of total\r\n  mutate(freq = round(count / sum(count), 2))\r\n\r\n# plot monitored status\r\nall <- ggplot(data = all_nests_monitored, aes(x = year, y = freq, fill = monitored_y_n, label = freq)) +\r\n  geom_col(position = \"fill\", stat = \"identity\") +\r\n  geom_text(size = 2.5, position = position_stack(vjust = 0.5)) +\r\n  scale_fill_manual(values = c(\"#fdb813\", \"#0079c2\")) +\r\n  theme(\r\n    legend.position = \"none\",\r\n    panel.background = element_blank(),\r\n    axis.text.y = element_blank(),\r\n    axis.ticks.y = element_blank(),\r\n    axis.title.y = element_blank(),\r\n    axis.text.x = element_blank(),\r\n    #axis.ticks.x = element_blank(),\r\n    axis.title.x = element_text(),\r\n    plot.margin = margin(0,0,0,0,\"pt\")\r\n  ) + \r\n  labs(x = \"All Nests\")\r\n  \r\n# OLD LYME ONLY\r\n\r\n# create data set with counts of nests by monitored status\r\nol_nests_monitored <- ol_nests %>% \r\n  \r\n  # select only monitored status column\r\n  select(monitored) %>% \r\n  \r\n  # count by monitored status\r\n  group_by(monitored) %>% \r\n  summarize(count = n()) %>%\r\n  \r\n  # Add dummy year value for plot\r\n  mutate(year = \"2020\") %>% \r\n  \r\n  # Add proportion of total\r\n  mutate(freq = round(count / sum(count), 2))\r\n\r\n\r\n# plot monitored status\r\nol <- ggplot(data = ol_nests_monitored, aes(x = year, y = freq, fill = monitored, label = freq)) +\r\n  geom_col(position = \"fill\", stat = \"identity\") +\r\n  geom_text(size = 2.5, position = position_stack(vjust = 0.5)) +\r\n  scale_fill_manual(values = c(\"#fdb813\", \"#0079c2\")) +\r\n  theme(\r\n    legend.title = element_blank(),\r\n    panel.background = element_blank(),\r\n    axis.text.y = element_blank(),\r\n    axis.ticks.y = element_blank(),\r\n    axis.title.y = element_blank(),\r\n    axis.text.x = element_blank(),\r\n    #axis.ticks.x = element_blank(),\r\n    axis.title.x = element_text(),\r\n    plot.margin = margin(0,0,0,0,\"pt\")\r\n  ) + \r\n  labs(x = \"Old Lyme Nests\")\r\n\r\nall + ol +\r\n  plot_annotation(title = \"What Percent of Nests Were Actively Monitored in 2020?\",\r\n                  theme = theme(plot.title = element_text(hjust = 0.5)))\r\n\r\n\r\n\r\nIn my datasets, there are 958 total nests and 95 nests in Old Lyme.\r\nThis plot shows that 91% of these nests in the entire state and 96% of\r\nnests in Old Lyme were actively monitored in 2020.\r\nNext, let’s look at the types of nests that exist. Looking at the\r\ndata set of all 958 nests in Connecticut, there are a staggering\r\n200 unique nest types entered by stewards (after\r\naccounting for capitalization and white space). Many of these are\r\ndifferent ways of saying the same thing: For example, a light pole could\r\nbe entered as light post, electric pole, utility pole, on a light pole,\r\nlight tower, light fixture, etc. In addition, some nest types included\r\nnotes, such as dates that platforms were built or “difficult to\r\nsee”.\r\nInstead of re-categorizing all of these nests here, I will simply\r\nhighlight the most common nest types and the need for standardization of\r\nthis column in future years.\r\n\r\n\r\nShow code\r\n\r\nall_nest_types <- all_nests %>% \r\n  \r\n  # select only nest type column\r\n  select(nest_type) %>% \r\n  \r\n  # remove blanks\r\n  filter(nest_type != \"\") %>% \r\n  \r\n  # aggregate strings with different cases and white space\r\n  mutate(nest_type = tolower(nest_type)) %>% \r\n  mutate(nest_type = trimws(nest_type)) %>% \r\n  \r\n  # count by nest type\r\n  group_by(nest_type) %>% \r\n  summarize(count = n()) %>% \r\n  \r\n  # only show top 10 most common nest types\r\n  arrange(desc(count)) %>% \r\n  slice(1:10)\r\n\r\nggplot(data = all_nest_types, aes(x = count, y = reorder(nest_type, count), fill = nest_type)) +\r\n  geom_col() +\r\n  geom_text(aes(label = count), vjust = 0.5, hjust = -.5, size = 2.5) +\r\n  scale_fill_paletteer_d(\"RColorBrewer::Paired\") +\r\n  theme_minimal() +\r\n  theme(\r\n    legend.position = \"none\",\r\n    axis.title.y = element_blank(),\r\n    axis.text.y = element_text(margin = margin(t = 0, r = -15, b = 0, l = 0, unit = \"pt\")),\r\n    panel.grid.major.y = element_blank()\r\n  ) +\r\n  labs(\r\n    title = \"What Are The Top 10 Most Common Nest Types?\",\r\n    x = \"Count\"\r\n  )\r\n\r\n\r\n\r\nThis plot shows that platform nests are by far the\r\nmost common nest type, making up ~35% of all nests. It is important to\r\nnote that 191 nests had no data on nest type,\r\nrepresenting ~20% of all nests.\r\n\r\n\r\nShow code\r\n\r\nol_nest_types <- ol_nests %>% \r\n  \r\n  # select only nest type column\r\n  select(nest_type) %>%\r\n  \r\n  # aggregate strings with different cases and white space\r\n  mutate(nest_type = tolower(nest_type)) %>% \r\n  mutate(nest_type = trimws(nest_type)) %>% \r\n  \r\n  # count by nest type\r\n  group_by(nest_type) %>% \r\n  summarize(count = n()) %>% \r\n  \r\n  # arrange by count desc\r\n  arrange(desc(count))\r\n\r\n\r\n60 of the 95 nests in Old Lyme had no data on nest type, making up\r\n~31% of missing nest types despite Old Lyme only holding ~10% of total\r\nnests. 19 of the 35 nests with data inputted were platforms, which is\r\nconsistent with the overall data set.\r\nThe map below highlights the nests in Old Lyme with missing nest type\r\ndata for potential data capture in the next year’s report:\r\n\r\nMap of Missing Nest Type Data in Old Lyme, CT.\r\nNests with missing data are spatially distributed throughout the\r\ntown’s coastline. This data should be collected to allow for potential\r\nanalysis of the relationship between nest type and success rates of\r\nfledglings.\r\nFinally, I want to look at the final nest status data.\r\n\r\nMap of Nest Status at the end of the 2020 Osprey season in Old Lyme,\r\nCT.\r\nThe success of the nest appears to be randomly distributed across all\r\nlocations. Many sites on Great Island were left as “Active”, which\r\nindicates that a final report on fledglings was not obtained. This could\r\nbe due to the difficulty of access for some of these sites.\r\n\r\n\r\nShow code\r\n\r\nol_nests_status <- ol_nests %>% \r\n  \r\n  # select only 2021 status column\r\n  select(x2021_status) %>% \r\n  \r\n  # count by nest status\r\n  group_by(x2021_status) %>% \r\n  summarize(count = n()) %>% \r\n  \r\n  # add a readable column for status\r\n  mutate(status_desc = case_when(x2021_status == \"AB\" ~ \"No Incubation\",\r\n                                 x2021_status == \"A\" ~ \"Active\",\r\n                                 x2021_status == \"S(2)\" ~ \"Successful (2 Fledglings)\",\r\n                                 x2021_status == \"NU\" ~ \"Needs Update\",\r\n                                 x2021_status == \"ND\" ~ \"No Data\",\r\n                                 x2021_status == \"S(1)\" ~ \"Successful (1 Fledling)\",\r\n                                 x2021_status == \"IF\" ~ \"Incubation Failure\",\r\n                                 x2021_status == \"S(3)\" ~ \"Successful (3 Fledlings)\",\r\n                                 x2021_status == \"PH\" ~ \"Post-Hatch Failure\",\r\n                                 x2021_status == \"DR\" ~ \"Damaged/Removed\",\r\n                                 x2021_status == \"S(4)\" ~ \"Successful (4 Fledglings)\"))\r\n\r\nggplot(data = ol_nests_status, aes(x = count, y = reorder(status_desc, count), fill = x2021_status)) +\r\n  geom_col() +\r\n  geom_text(aes(label = count), vjust = 0.5, hjust = -.5, size = 2.5) +\r\n  scale_fill_paletteer_d(\"RColorBrewer::Paired\") +\r\n  theme_minimal() +\r\n  theme(\r\n    legend.position = \"none\",\r\n    axis.title.y = element_blank(),\r\n    axis.text.y = element_text(margin = margin(t = 0, r = -15, b = 0, l = 0, unit = \"pt\")),\r\n    panel.grid.major.y = element_blank()\r\n  ) +\r\n  labs(\r\n    title = \"Old Lyme Final Nest Status Data 2020\",\r\n    x = \"Count\"\r\n  )\r\n\r\n\r\n\r\nThe plot above shows the final status of nests in Old Lyme for 2020.\r\nIn all, there were 16 successful nests out of the total of 95, with 30\r\nfledglings reported and likely more unreported. In summary, Old Lyme has\r\n~10% of the state’s nests and yielded 5.88% of reported fledglings.\r\nFinally, here is a fun heat map of nest locations in the town:\r\n\r\nHeatmap of Nests in Old Lyme, CT.\r\nThis illustrates the density of nests on and around Great Island -\r\nwhich holds the most nests in one place in all of Connecticut! It is\r\nevident that this area is deserving of the conservation and appreciation\r\nthat it deserves.\r\nRecommendations\r\nCritical information such as osprey arrival dates and departure dates\r\nare difficult to analyze as they are only included in a verbose\r\n“description” column. Key statistics like these should be saved in\r\nseparate columns in order to be more useful for long-term insights.\r\nReflections\r\nThis was my first attempt at an independent blog post focusing on\r\ndata visualization. The main difficulty was finding the time to work on\r\nthis project while balancing work and graduate school! Nonetheless, I\r\nlearned a lot about integrating text, plots, and maps to tell a story.\r\nIn the future, I hope to improve my skills in all three of these areas.\r\nAlso, I hope to make blog posts that are more interactive.\r\n\r\n\r\n\r\n\r\n",
    "preview": "portfolio/2021-09-20-old-lyme-ospreys-2020-season-review/old-lyme-ospreys-2020-season-review_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2023-03-10T22:45:18-08:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
